3A/CS349/Widgets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-24 Sat 02:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Widgets</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Widgets</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd23e0a3">1. Logical Input Devics</a>
<ul>
<li><a href="#orgf5a7c5e">1.1. Widget Functions</a></li>
<li><a href="#org1d7d553">1.2. Logical Input Device</a>
<ul>
<li><a href="#orgee0190e">1.2.1. Logical Button Device</a></li>
<li><a href="#org49ce555">1.2.2. Logical Number Device</a></li>
<li><a href="#org5a80cda">1.2.3. Logical Boolean Device</a></li>
<li><a href="#org98669ec">1.2.4. Logical Text Device</a></li>
<li><a href="#org1cfcf35">1.2.5. Logical Choice Device</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7f549c3">2. Widgets Types</a>
<ul>
<li><a href="#orgb5a98c5">2.1. Container Widgets</a></li>
<li><a href="#orgf39a932">2.2. Specialized Widgets</a></li>
</ul>
</li>
<li><a href="#org374955e">3. Widget Implementation</a>
<ul>
<li><a href="#org18f73d8">3.1. Widget Toolkit Design Goals</a>
<ul>
<li><a href="#orgca2bbd7">3.1.1. Completeness</a></li>
<li><a href="#orgfc141e0">3.1.2. Widget Choice</a></li>
<li><a href="#orgc4be9e8">3.1.3. Customization</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd23e0a3" class="outline-2">
<h2 id="orgd23e0a3"><span class="section-number-2">1.</span> Logical Input Devics</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Widget</b>: part of an interface that has its own behaviour
</p>

<p>
Characteristics of widgets are what essential functions they enable (logical input device),
simple vs container widgets, their behaviour (events they generate and how state changes
them), and what they look like (rendering).
</p>
</div>
<div id="outline-container-orgf5a7c5e" class="outline-3">
<h3 id="orgf5a7c5e"><span class="section-number-3">1.1.</span> Widget Functions</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><b>display user feedback</b>: convey current state and when action is triggered</li>
<li><b>handle user input</b>: capture user input and generate events</li>
</ol>
</div>
</div>
<div id="outline-container-org1d7d553" class="outline-3">
<h3 id="org1d7d553"><span class="section-number-3">1.2.</span> Logical Input Device</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Describes a widget based on function (not appearance):
</p>
<ul class="org-ul">
<li>a category of widgets based on a common functioanlity</li>
<li>a widget is a <i>specific instance</i> of a logical input device</li>
</ul>
</div>
<div id="outline-container-orgee0190e" class="outline-4">
<h4 id="orgee0190e"><span class="section-number-4">1.2.1.</span> Logical Button Device</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Input a single action and send an &ldquo;action happened&rdquo; event.
</p>

<p>
Could be a button or menu item.
</p>
</div>
</div>
<div id="outline-container-org49ce555" class="outline-4">
<h4 id="org49ce555"><span class="section-number-4">1.2.2.</span> Logical Number Device</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Input and display a numeric value in a certain range, that may have validation
and sends a &ldquo;value changed&rdquo; event.
</p>

<p>
Could be slider, spinner, or progress bar.
</p>
</div>
</div>
<div id="outline-container-org5a80cda" class="outline-4">
<h4 id="org5a80cda"><span class="section-number-4">1.2.3.</span> Logical Boolean Device</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Input and display a boolean device that sends a &ldquo;value changed&rdquo; event.
</p>

<p>
Could be a checkbox, toggle, or radio button.
</p>
</div>
</div>
<div id="outline-container-org98669ec" class="outline-4">
<h4 id="org98669ec"><span class="section-number-4">1.2.4.</span> Logical Text Device</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Displays a text valuea and can allow editing which sends a &ldquo;value changed&rdquo; event.
</p>

<p>
Could be a label or text field.
</p>
</div>
</div>
<div id="outline-container-org1cfcf35" class="outline-4">
<h4 id="org1cfcf35"><span class="section-number-4">1.2.5.</span> Logical Choice Device</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Input and display one choice among a list which sends a &ldquo;selection changed&rdquo; event.
</p>

<p>
Could be a dropdown or combo box.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org7f549c3" class="outline-2">
<h2 id="org7f549c3"><span class="section-number-2">2.</span> Widgets Types</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb5a98c5" class="outline-3">
<h3 id="orgb5a98c5"><span class="section-number-3">2.1.</span> Container Widgets</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Holds child widgets that are drawn relative to container position, which creates
a widget tree.
</p>

<p>
<b>Panel</b>: set of widgets in a layout
</p>

<p>
<b>Tabs</b>: choice between set of widgets
</p>
</div>
</div>
<div id="outline-container-orgf39a932" class="outline-3">
<h3 id="orgf39a932"><span class="section-number-3">2.2.</span> Specialized Widgets</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Menu</b>: hierarchical list of buttons
</p>

<p>
<b>Pasword Textfield</b>: uses dots for each character entered
</p>

<p>
<b>Special Value Widgets</b>: date, colour, file, etc. pickers
</p>
</div>
</div>
</div>
<div id="outline-container-org374955e" class="outline-2">
<h2 id="org374955e"><span class="section-number-2">3.</span> Widget Implementation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org18f73d8" class="outline-3">
<h3 id="org18f73d8"><span class="section-number-3">3.1.</span> Widget Toolkit Design Goals</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li><b>Completeness</b>: GUI designers have everything they needed</li>
<li><b>Consistency</b>: behaviour is consistent across components</li>
<li><b>Customizability</b>: developer can reasonably extend functionality to meet
particular needs of applicatoin</li>
</ol>

<p>
Meeting these requirements encourages reuse.
</p>
</div>
<div id="outline-container-orgca2bbd7" class="outline-4">
<h4 id="orgca2bbd7"><span class="section-number-4">3.1.1.</span> Completeness</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
For completeness, a button, slider, pulldown menu, checkbox, radio buttons,
text fields, and spinner are all that is needed.
</p>
</div>
</div>
<div id="outline-container-orgfc141e0" class="outline-4">
<h4 id="orgfc141e0"><span class="section-number-4">3.1.2.</span> Widget Choice</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Should use a common look and feel and be used appropriately.
</p>
</div>
</div>
<div id="outline-container-orgc4be9e8" class="outline-4">
<h4 id="orgc4be9e8"><span class="section-number-4">3.1.3.</span> Customization</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Support changing some widget behaviour and appearance by exposing key appearance
or behaviour properties.
</p>

<p>
Expose class hierarchy that promotes customization, such as using a base class
that implements a logical button device.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-24 Sat 02:13</p>
</div>
</body>
</html>
